content/man/man1/flatpak-make-current.1.org
#+TITLE: Manpages - flatpak-make-current.1
* NAME
flatpak-make-current - Make a specific version of an app current

* SYNOPSIS
*flatpak make-current* [OPTION...] APP BRANCH

* DESCRIPTION
Makes a particular branch of an application current. Only the current
branch of an app has its exported files (such as desktop files and
icons) made visible to the host.

When a new branch is installed it will automatically be made current, so
this command is often not needed.

Unless overridden with the *--user* or *--installation* options, this
command changes the default system-wide installation.

* OPTIONS
The following options are understood:

*-h*, *--help*

#+begin_quote
Show help options and exit.

#+end_quote

*-u*, *--user*

#+begin_quote
Update a per-user installation.

#+end_quote

*--system*

#+begin_quote
Update the default system-wide installation.

#+end_quote

*--installation=NAME*

#+begin_quote
Updates a system-wide installation specified by NAME among those defined
in /etc/flatpak/installations.d/. Using *--installation=default* is
equivalent to using *--system*.

#+end_quote

*--arch=ARCH*

#+begin_quote
The architecture to make current for. See *flatpak --supported-arches*
for architectures supported by the host.

#+end_quote

*-v*, *--verbose*

#+begin_quote
Print debug information during command processing.

#+end_quote

*--ostree-verbose*

#+begin_quote
Print OSTree debug information during command processing.

#+end_quote

* EXAMPLES
*$ flatpak --user make-current org.gnome.gedit 3.14*

* SEE ALSO
*flatpak*(1), *flatpak-install*(1), *flatpak-list*(1)
